package com.vsv.feature_alarm_clock.test_or_later

/**
 * есть модель AlarmItem
 * у нее есть рингтон
 * чтобы поставить рингтон нужен контекст
 * есть 2 экрана: список итемов и список рингтонов, у каждого свой стейт
 * дефолтный рингтон определяется системой
 * далее дефолтный рингтон заменяется тем, который был выбран последним
 * получить последний выбранный можно из экрана с рингтонами
 * какой порядок действий?
 * открывается стартовый экран
 * при добавлении аларма должнен назначится рингтон +
 *
 * */